#+TITLE: Planning/designing the Strasheela Successor
#+AUTHOR: Torsten Anders

# See also [[file:~/oz/music/Strasheela/strasheela/strasheela/others/TODO/Strasheela-TODO.org::*Real-time%20constraint%20programming%20in%20Lisp%20(or%20other%20high-level%20languages)][Real-time constraint programming in Lisp (or other high-level languages)]]

** Plain C++ examples 

#+begin_src cpp :includes <iostream>
int a=30;
int b=3;
// printf("%d\n", a+b);
std::cout << a+b << "\n";
#+end_src

#+RESULTS:
: 33

